app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2019-05-21 20:18:33.945997"], ["id", 1]]
---
  def update
    @article = Article.find(params[:id])

    if @article.title == params[:article][:title] && @article.description == params[:article][:description]
    elsif @article.title == params[:article][:title]
      @article.update(description: params[:article][:description])